morfredus/ESP32-Diagnostic/src/main.cpp
/*
// Handlers dupliqués commentés pour éviter les redéfinitions
void handleRGBLedConfig() {}
void handleLightSensorConfig() {}
void handleDistanceSensorConfig() {}
void handleMotionSensorConfig() {}
void handleTFTConfig() {}
void handleBuiltinLEDConfig() {}
void handleNeoPixelConfig() {}
*/
/*
 * ESP32 Diagnostic Suite
 * Compatible: ESP32 class targets with >=4MB Flash & >=8MB PSRAM (ESP32 / ESP32-S3)
 * Optimized for ESP32 Arduino Core 3.3.3 / PlatformIO
 * Tested board: ESP32-S3 DevKitC-1 N16R8 with PSRAM OPI (Core 3.3.3)
 * Author: morfredus
 */

#include <WiFi.h>
#include <WiFiMulti.h>
#include <WebServer.h>

#if defined(ARDUINO_ARCH_ESP32)
  #include <freertos/FreeRTOS.h>
  #include <freertos/task.h>
  #if defined(__has_include)
    #if __has_include(<ESPmDNS.h>)
      #include <ESPmDNS.h>
      #define DIAGNOSTIC_HAS_MDNS 1
      #define DIAGNOSTIC_USES_ESPMDNS 1
    #elif __has_include(<mdns.h>)
      #include <mdns.h>
      #define DIAGNOSTIC_HAS_MDNS 1
      #define DIAGNOSTIC_USES_IDF_MDNS 1
    #else
      #define DIAGNOSTIC_HAS_MDNS 0
    #endif
  #else
    #include <ESPmDNS.h>
    #define DIAGNOSTIC_HAS_MDNS 1
    #define DIAGNOSTIC_USES_ESPMDNS 1
  #endif
#else
  #define DIAGNOSTIC_HAS_MDNS 0
#endif

#if !defined(DIAGNOSTIC_HAS_MDNS)
  #define DIAGNOSTIC_HAS_MDNS 0
#endif

#if DIAGNOSTIC_HAS_MDNS && defined(DIAGNOSTIC_USES_ESPMDNS)
  #if defined(NO_GLOBAL_MDNS) || defined(NO_GLOBAL_INSTANCES)
    static MDNSResponder diagnosticMDNSResponder;
    #define DIAGNOSTIC_MDNS_SERVER diagnosticMDNSResponder
  #else
    #define DIAGNOSTIC_MDNS_SERVER MDNS
  #endif
#endif
#include <esp_chip_info.h>
#include <esp_err.h>
#include <esp_mac.h>
#include <esp_flash.h>
#include <esp_heap_caps.h>
#include <esp_partition.h>
#include <esp_wifi.h>
#include <esp_task_wdt.h>
#if defined(__has_include)
  #if __has_include(<sdkconfig.h>)
    #include <sdkconfig.h>
    #define DIAGNOSTIC_HAS_SDKCONFIG 1
  #endif
  #if __has_include(<esp_netif.h>)
    #include <esp_netif.h>
    #define DIAGNOSTIC_HAS_ESP_NETIF 1
  #endif
#else
  #include <esp_netif.h>
  #define DIAGNOSTIC_HAS_ESP_NETIF 1
#endif
#if !defined(DIAGNOSTIC_HAS_SDKCONFIG)
  #define DIAGNOSTIC_HAS_SDKCONFIG 0
#endif
#include <soc/soc.h>
#include <soc/rtc.h>
#if defined(__has_include)
  #if __has_include(<soc/soc_caps.h>)
    #include <soc/soc_caps.h>
  #endif
#else
  #include <soc/soc_caps.h>
#endif
#include <Wire.h>
#include <Adafruit_NeoPixel.h>
#include <U8g2lib.h>
#include <vector>
#include <cstring>
#include <string>
#include <initializer_list>
#include "json_helpers.h"

// Configuration file - customize your setup
// Copy include/config-example.h to include/config.h and customize your settings
#include "config.h"

// Secrets file - customize your network credentials
// For reference, see include/secrets-example.h
// secrets.h is excluded from version control via .gitignore
#include "secrets.h"

// Dual-language UI strings
#include "languages.h"

// TFT Display support
#include "tft_display.h"

// GPS module
#include "gps_module.h"

// Environmental sensors (AHT20 + BMP280)
#include "environmental_sensors.h"

// Set default language from config.h
Language currentLanguage = DEFAULT_LANGUAGE;

static String buildActionResponseJson(bool success,
                                      const String& message,
                                      std::initializer_list<JsonFieldSpec> extraFields = {});
String htmlEscape(const String& raw);
String jsonEscape(const char* raw);
inline void sendJsonResponse(int statusCode, std::initializer_list<JsonFieldSpec> fields);
String buildTranslationsJSON();
String buildTranslationsJSON(Language lang);
inline void sendActionResponse(int statusCode,
                               bool success,
                               const String& message,
                               std::initializer_list<JsonFieldSpec> extraFields = {});
inline void sendOperationSuccess(const String& message,
                                 std::initializer_list<JsonFieldSpec> extraFields = {});
inline void sendOperationError(int statusCode,
                               const String& message,
                               std::initializer_list<JsonFieldSpec> extraFields = {});

#if defined(__has_include)
  #if __has_include(<esp_arduino_version.h>)
    #include <esp_arduino_version.h>
  #endif
#endif

#ifndef ESP_ARDUINO_VERSION_VAL
#define ESP_ARDUINO_VERSION_VAL(major, minor, patch) ((major << 16) | (minor << 8) | (patch))
#endif

#ifndef ESP_ARDUINO_VERSION
#if defined(ESP_ARDUINO_VERSION_MAJOR) && defined(ESP_ARDUINO_VERSION_MINOR) && defined(ESP_ARDUINO_VERSION_PATCH)
#define ESP_ARDUINO_VERSION ESP_ARDUINO_VERSION_VAL(ESP_ARDUINO_VERSION_MAJOR, ESP_ARDUINO_VERSION_MINOR, ESP_ARDUINO_VERSION_PATCH)
#else
#define ESP_ARDUINO_VERSION ESP_ARDUINO_VERSION_VAL(0, 0, 0)
#endif
#endif

// ========== CONFIGURATION (from config.h) ==========
// Version is now defined in platformio.ini as PROJECT_VERSION
const char* DIAGNOSTIC_VERSION_STR = PROJECT_VERSION;
const char* MDNS_HOSTNAME_STR = DIAGNOSTIC_HOSTNAME;

// HTTPS/HTTP scheme constants
const char* const DIAGNOSTIC_SECURE_SCHEME = "https://";
const char* const DIAGNOSTIC_LEGACY_SCHEME = "http://";

#ifndef DIAGNOSTIC_UNUSED
#define DIAGNOSTIC_UNUSED __attribute__((unused))
#endif

static inline String buildAccessUrl(const String& hostOrAddress,
                                    bool preferSecure = (DIAGNOSTIC_PREFER_SECURE != 0)) {
  if (hostOrAddress.length() == 0) {
    return String();
  }
  const String secureScheme = String(DIAGNOSTIC_SECURE_SCHEME);
  const String legacyScheme = String(DIAGNOSTIC_LEGACY_SCHEME);
  return (preferSecure ? secureScheme : legacyScheme) + hostOrAddress;
}

static inline String getStableAccessHost() {
  return String(DIAGNOSTIC_HOSTNAME) + ".local";
}

String getArduinoCoreVersionString() {
// [OPT-001] Optimize version string formatting: use snprintf instead of multiple String concatenations
#if defined(ESP_ARDUINO_VERSION_MAJOR) && defined(ESP_ARDUINO_VERSION_MINOR) && defined(ESP_ARDUINO_VERSION_PATCH)
  char versionBuf[16];
  snprintf(versionBuf, sizeof(versionBuf), "%u.%u.%u", 
    ESP_ARDUINO_VERSION_MAJOR, ESP_ARDUINO_VERSION_MINOR, ESP_ARDUINO_VERSION_PATCH);
  return String(versionBuf);
#else
  uint32_t value = ESP_ARDUINO_VERSION;
  int major = (value >> 16) & 0xFF;
  int minor = (value >> 8) & 0xFF;
  int patch = value & 0xFF;
  char versionBuf[16];
  snprintf(versionBuf, sizeof(versionBuf), "%d.%d.%d", major, minor, patch);
  return String(versionBuf);
#endif
}

// ========== HARDWARE PIN CONFIGURATION (référence board_config.h) ========== 
// RGB LED
int current_rgb_r = LED_RED;
int current_rgb_g = LED_GREEN;
int current_rgb_b = LED_BLUE;
// Capteurs
int current_light_sensor = LIGHT_SENSOR;
int current_distance_trig = DISTANCE_TRIG;
int current_distance_echo = DISTANCE_ECHO;
int current_motion_sensor = MOTION_SENSOR;
// TFT
int current_tft_mosi = TFT_MOSI;
int current_tft_sclk = TFT_SCLK;
int current_tft_cs = TFT_CS;
int current_tft_dc = TFT_DC;
int current_tft_rst = TFT_RST;
int current_tft_bl = TFT_BL;
// Toutes les pins sont désormais référencées uniquement via board_config.h
// Utilisation stricte des macros :
//   - I2C_SCL, I2C_SDA
//   - LED_RED, LED_GREEN, LED_BLUE, NEOPIXEL
//   - BUZZER, DHT, LIGHT_SENSOR, DISTANCE_TRIG, DISTANCE_ECHO, MOTION_SENSOR
//   - BUTTON_BOOT, BUTTON_1, BUTTON_2
//   - TFT_MOSI, TFT_SCLK, TFT_CS, TFT_DC, TFT_RST, TFT_BL
//   - GPS_RXD, GPS_TXD, GPS_PPS
//   - etc.

// OLED display settings (inchangés)

// Variables runtime pour pins modifiables dynamiquement (initialisées avec macros board_config.h)
int current_led_builtin = LED_BUILTIN;
int current_neopixel = NEOPIXEL;
int current_neopixel_count = DEFAULT_NEOPIXEL_COUNT;
uint8_t oledRotation = DEFAULT_OLED_ROTATION;
int oledWidth = SCREEN_WIDTH;
int oledHeight = SCREEN_HEIGHT;

// ========== OBJETS GLOBAUX ========== 
WebServer server(WEB_SERVER_PORT);
WiFiMulti wifiMulti;
#if DIAGNOSTIC_HAS_MDNS
bool mdnsServiceActive = false;
bool wifiPreviouslyConnected = false;
unsigned long lastMDNSAttempt = 0;
bool mdnsLastAttemptFailed = false;
#if defined(DIAGNOSTIC_USES_IDF_MDNS)
bool mdnsResponderInitialized = false;
#endif
#endif
U8G2_SSD1306_128X64_NONAME_F_HW_I2C oled(U8G2_R0, U8X8_PIN_NONE);


