morfredus/ESP32-Diagnostic/src/main.cpp
// NeoPixel (référence board_config.h)
// Utiliser directement NEOPIXEL et DEFAULT_NEOPIXEL_COUNT

// TFT pins (référence board_config.h)
#if ENABLE_TFT_DISPLAY
// Utiliser directement TFT_MOSI, TFT_SCLK, TFT_CS, TFT_DC, TFT_RST, TFT_BL
int tftWidth = TFT_WIDTH;
int tftHeight = TFT_HEIGHT;
int tftRotation = TFT_ROTATION;
#endif
Adafruit_NeoPixel *strip = nullptr;

// NeoPixel heartbeat state
volatile bool neopixelStatusPaused = false;
unsigned long neopixelHeartbeatPreviousMillis = 0;
const unsigned long NEOPIXEL_HEARTBEAT_INTERVAL_MS = 1000;
bool neopixelHeartbeatState = false;
bool neopixelStatusKnown = false;
bool neopixelLastWifiConnected = false;
bool neopixelConnecting = false;

// [OPT-004] Constant for repeated test result initialization
static const String DEFAULT_TEST_RESULT_STR = String(Texts::not_tested);
// [OPT-009] Constants for repeated test status strings
static const String OK_STR = String(Texts::ok);
static const String FAIL_STR = String(Texts::fail);

bool neopixelTested = false;
bool neopixelAvailable = false;
bool neopixelSupported = false;
String neopixelTestResult = DEFAULT_TEST_RESULT_STR;

// Forward declarations for NeoPixel functions
void neopixelShowRebootFlash();
void neopixelSetWifiState(bool connected);
void neopixelShowConnecting();
void neopixelPauseStatus();
void neopixelResumeStatus();
void neopixelRestoreWifiStatus();
void updateNeoPixelWifiStatus();

// Built-in LED (référence board_config.h)
// Utiliser directement LED_BUILTIN
bool builtinLedTested = false;
bool builtinLedAvailable = false;
String builtinLedTestResult = DEFAULT_TEST_RESULT_STR;

bool oledTested = false;
bool oledAvailable = false;
String oledTestResult = DEFAULT_TEST_RESULT_STR;

#if ENABLE_TFT_DISPLAY
String tftTestResult = DEFAULT_TEST_RESULT_STR;
#endif

// Exécution asynchrone des tests matériels
typedef void (*TestRoutine)();

struct AsyncTestRunner {
  const char* taskName;
  TaskHandle_t taskHandle;
  volatile bool running;
};

struct AsyncTestTaskArgs {
  AsyncTestRunner* runner;
  TestRoutine routine;
};

static void asyncTestTask(void* parameters) {
  AsyncTestTaskArgs* args = static_cast<AsyncTestTaskArgs*>(parameters);
  if (args && args->routine) {
    args->routine();
  }
  if (args) {
    if (args->runner) {
      args->runner->running = false;
      args->runner->taskHandle = nullptr;
    }
    delete args;
  }
  vTaskDelete(nullptr);
}

static bool startAsyncTest(AsyncTestRunner& runner,
                           TestRoutine routine,
                           bool& alreadyRunning,
                           uint32_t stackSize = 4096,
                           UBaseType_t priority = 1) {
  alreadyRunning = runner.running;
  if (runner.running) {
    return false;
  }

  AsyncTestTaskArgs* args = new AsyncTestTaskArgs{&runner, routine};
  runner.running = true;

#if CONFIG_FREERTOS_UNICORE
  const BaseType_t targetCore = tskNO_AFFINITY;
#else
  const BaseType_t targetCore = 1;
#endif

  BaseType_t result = xTaskCreatePinnedToCore(asyncTestTask,
                                              runner.taskName,
                                              stackSize,
                                              args,
                                              priority,
                                              &runner.taskHandle,
                                              targetCore);
  if (result != pdPASS) {
    runner.running = false;
    runner.taskHandle = nullptr;
    delete args;
    alreadyRunning = false;
    return false;
  }

  alreadyRunning = false;
  return true;
}

// Orchestrateurs asynchrones des tests lents
static AsyncTestRunner builtinLedTestRunner = {"BuiltinLEDTest", nullptr, false};
static AsyncTestRunner neopixelTestRunner = {"NeoPixelTest", nullptr, false};
static AsyncTestRunner oledTestRunner = {"OLEDTest", nullptr, false};
static AsyncTestRunner rgbLedTestRunner = {"RgbLedTest", nullptr, false};
static AsyncTestRunner buzzerTestRunner = {"BuzzerTest", nullptr, false};

bool runtimeBLE = false;

String adcTestResult = DEFAULT_TEST_RESULT_STR;
String pwmTestResult = DEFAULT_TEST_RESULT_STR;
String partitionsInfo;
String spiInfo;
String stressTestResult = DEFAULT_TEST_RESULT_STR;
// Memory stress telemetry cache
size_t stressAllocationCount = 0;
unsigned long stressDurationMs = 0;

// Résultats de tests des nouveaux capteurs
String rgbLedTestResult = DEFAULT_TEST_RESULT_STR;
bool rgbLedAvailable = false;

String buzzerTestResult = DEFAULT_TEST_RESULT_STR;
bool buzzerAvailable = false;

String dhtTestResult = DEFAULT_TEST_RESULT_STR;
bool dhtAvailable = false;
float dhtTemperature = -999.0;
float dhtHumidity = -999.0;

String lightSensorTestResult = DEFAULT_TEST_RESULT_STR;
bool lightSensorAvailable = false;
int lightSensorValue = -1;

String distanceSensorTestResult = DEFAULT_TEST_RESULT_STR;
bool distanceSensorAvailable = false;
float distanceValue = -1.0;

String motionSensorTestResult = DEFAULT_TEST_RESULT_STR;
bool motionSensorAvailable = false;
bool motionDetected = false;


// ========== BOUTONS ========== 
// Gestion stricte via macros board_config.h
#if ENABLE_BUTTONS
static int buttonBootPin = BUTTON_BOOT;
static int button1Pin = BUTTON_1;
static int button2Pin = BUTTON_2;
static int buttonBootLast = HIGH;
static int button1Last = HIGH;
static int button2Last = HIGH;
static unsigned long buttonBootPressStart = 0;
static unsigned long button1LastChange = 0;
static unsigned long button2LastChange = 0;
static const unsigned long debounceMs = 30;
static const unsigned long longPressMs = 2000;
static bool buttonBootLongPressTriggered = false;

static void initButtons() {
  // Bouton BOOT (référence board_config.h)
    if (BUTTON_BOOT >= 0 && BUTTON_BOOT <= 48) {
      pinMode(BUTTON_BOOT, INPUT_PULLUP);
    }
    // Bouton 1
    if (BUTTON_1 >= 0 && BUTTON_1 <= 48) {
      pinMode(BUTTON_1, INPUT_PULLUP);
    }
    // Bouton 2
    if (BUTTON_2 >= 0 && BUTTON_2 <= 48) {
      pinMode(BUTTON_2, INPUT_PULLUP);
    }
}

// Inline helper for NeoPixel reboot flash
inline void neopixelShowRebootFlash_Impl() {
  if (strip != nullptr) {
    strip->setBrightness(60);
    strip->setPixelColor(0, strip->Color(255, 0, 255)); // Violet
    strip->show();
  }
}

// Bouton BOOT: Appui long (2s) → reboot avec barre de progression TFT
static void onButtonBootLongPress() {
  // NeoPixel flash violet pour confirmer le reboot
  neopixelShowRebootFlash_Impl();
  
#if ENABLE_TFT_DISPLAY
  if (tftAvailable) {
    tft.fillScreen(TFT_BLACK);
    tft.setTextSize(2);
    tft.setTextColor(TFT_WHITE);
    tft.setCursor(10, 80);
    tft.println("Redemarrage...");
    
    // Barre de progression
    int barX = 20;
    int barY = 120;
    int barW = tftWidth - 40;
    int barH = 20;
    tft.drawRect(barX, barY, barW, barH, TFT_WHITE);
    
    for (int i = 0; i <= 100; i += 10) {
      int fillW = (barW - 4) * i / 100;
      tft.fillRect(barX + 2, barY + 2, fillW, barH - 4, TFT_GREEN);
      delay(50);
    }
    delay(300);
  }
#endif
  ESP.restart();
}

// Bouton 1: Cycle de couleurs RGB avec position éteinte
static void onButton1Pressed() {
  static int rgbStep = 0;
  int r = 0, g = 0, b = 0;
  
  switch (rgbStep % 5) {
    case 0: r = 0; g = 0; b = 0; break;       // Éteint
    case 1: r = 255; g = 0; b = 0; break;     // Rouge
    case 2: r = 0; g = 255; b = 0; break;     // Vert
    case 3: r = 0; g = 0; b = 255; break;     // Bleu
    case 4: r = 255; g = 255; b = 255; break; // Blanc
  }
  
  analogWrite(LED_RED, r);
  analogWrite(LED_GREEN, g);
  analogWrite(LED_BLUE, b);
  
