morfredus/ESP32-Diagnostic/src/main.cpp
  rgbStep++;
}

// Bouton 2: Bip à l'appui
static void onButton2Pressed() {
  tone(BUZZER, 1000, 200);
}

static void maintainButtons() {
  unsigned long now = millis();
  
  // Bouton BOOT: Gestion appui long avec barre de progression pour reboot
  if (BUTTON_BOOT >= 0) {
    int s = digitalRead(BUTTON_BOOT);
    
    if (s == LOW && buttonBootLast == HIGH) {
      // Début d'appui
      buttonBootPressStart = now;
      buttonBootLongPressTriggered = false;
    }
    else if (s == LOW && buttonBootLast == LOW) {
      // Appui maintenu
      unsigned long pressDuration = now - buttonBootPressStart;
      
      if (pressDuration >= longPressMs && !buttonBootLongPressTriggered) {
        buttonBootLongPressTriggered = true;
        onButtonBootLongPress();
      }
      else if (pressDuration > debounceMs && pressDuration < longPressMs) {
        // Afficher la barre de progression pendant l'appui
#if ENABLE_TFT_DISPLAY
        if (tftAvailable && !buttonBootLongPressTriggered) {
          static unsigned long lastProgressUpdate = 0;
          if (now - lastProgressUpdate > 50) {
            lastProgressUpdate = now;
            
            tft.fillScreen(TFT_BLACK);
            tft.setTextSize(2);
            tft.setTextColor(TFT_YELLOW);
            tft.setCursor(10, 60);
            tft.println("Maintenir pour");
            tft.setCursor(10, 85);
            tft.println("redemarrer...");
            
            // Barre de progression
            int barX = 20;
            int barY = 130;
            int barW = tftWidth - 40;
            int barH = 20;
            tft.drawRect(barX, barY, barW, barH, TFT_WHITE);
            
            int progress = (pressDuration * 100) / longPressMs;
            if (progress > 100) progress = 100;
            int fillW = (barW - 4) * progress / 100;
            tft.fillRect(barX + 2, barY + 2, fillW, barH - 4, TFT_CYAN);
          }
        }
#endif
      }
    }
    else if (s == HIGH && buttonBootLast == LOW) {
      // Relâchement
      if (!buttonBootLongPressTriggered) {
        // Appui court ou relâché avant 2s → nettoyer l'écran
#if ENABLE_TFT_DISPLAY
        if (tftAvailable) {
          tft.fillScreen(TFT_BLACK);
          tft.setTextSize(1);
          tft.setTextColor(TFT_GREEN);
          tft.setCursor(10, 10);
          tft.println(PROJECT_NAME);
        }
#endif
      }
    }
    
    buttonBootLast = s;
  }
  
  // Bouton 1: Gestion appui simple pour cycle RGB
  if (BUTTON_1 >= 0) {
    int s = digitalRead(BUTTON_1);
    if (s != button1Last) {
      if (now - button1LastChange > debounceMs) {
        button1LastChange = now;
        button1Last = s;
        if (s == LOW) {
          onButton1Pressed();
        }
      }
    }
  }
  
  // Bouton 2: Gestion appui simple pour bip
  if (BUTTON_2 >= 0) {
    int s = digitalRead(BUTTON_2);
    if (s != button2Last) {
      if (now - button2LastChange > debounceMs) {
        button2LastChange = now;
        button2Last = s;
        if (s == LOW) {
          onButton2Pressed();
        }
      }
    }
  }
}
#endif

// ========== STRUCTURES ==========
struct DiagnosticInfo {
  String chipModel;
  String chipRevision;
  int cpuCores;
  uint32_t cpuFreqMHz;
  uint32_t flashSize;
  uint32_t psramSize;
  String macAddress;
  
  uint32_t heapSize;
  uint32_t freeHeap;
  uint32_t minFreeHeap;
  uint32_t maxAllocHeap;
  
  bool hasWiFi;
  bool hasBT;
  bool hasBLE;
  String wifiSSID;
  int wifiRSSI;
  String ipAddress;
  bool mdnsAvailable;
  bool bluetoothEnabled;
  bool bluetoothAdvertising;
  String bluetoothName;
  String bluetoothAddress;

  String gpioList;
  int totalGPIO;
  
  String sdkVersion;
  String idfVersion;
  unsigned long uptime;
  float temperature;
  
  bool neopixelTested;
  bool neopixelAvailable;
  String neopixelResult;
  
  unsigned long cpuBenchmark;
  unsigned long memBenchmark;
  
  String i2cDevices;
  int i2cCount;
  
  bool oledTested;
  bool oledAvailable;
  String oledResult;
} diagnosticData;

// Include web interface after DiagnosticInfo definition
#include "web_interface.h"

struct DetailedMemoryInfo {
  uint32_t flashSizeReal;
  uint32_t flashSizeChip;
  
  uint32_t psramTotal;
  uint32_t psramFree;
  uint32_t psramUsed;
  uint32_t psramLargestBlock;
  bool psramAvailable;
  bool psramConfigured;
  bool psramBoardSupported;
  const char* psramType;

  uint32_t sramTotal;
  uint32_t sramFree;
  uint32_t sramUsed;
  uint32_t sramLargestBlock;
  
  bool sramTestPassed;
  bool psramTestPassed;
  float fragmentationPercent;
  String memoryStatus;
};

DetailedMemoryInfo detailedMemory;

struct GPIOTestResult {
  int pin;
  bool tested;
  bool working;
  String mode;
  String notes;
};

std::vector<GPIOTestResult> gpioResults;

struct WiFiNetwork {
  String ssid;
  int rssi;
  int channel;
  String encryption;
  String bssid;
  int freqMHz;
  String band;
  String bandwidth;
  String phyModes;
};

std::vector<WiFiNetwork> wifiNetworks;

struct ADCReading {
  int pin;
  int rawValue;
  float voltage;
};

std::vector<ADCReading> adcReadings;

#define HISTORY_SIZE 60
float heapHistory[HISTORY_SIZE];
float tempHistory[HISTORY_SIZE];
int historyIndex = 0;

String getStableAccessURL() {
  return buildAccessUrl(getStableAccessHost());
}

void configureNetworkHostname() {
  if (!WiFi.setHostname(DIAGNOSTIC_HOSTNAME)) {
    Serial.printf("[WiFi] Impossible de définir le nom d'hôte %s\r\n", DIAGNOSTIC_HOSTNAME);
  } else {
    Serial.printf("[WiFi] Nom d'hôte défini : %s.local\r\n", DIAGNOSTIC_HOSTNAME);
  }
#if defined(ARDUINO_ARCH_ESP32)
  #if defined(DIAGNOSTIC_HAS_ESP_NETIF)
    esp_netif_t* staNetif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    if (staNetif != nullptr) {
      esp_err_t netifStatus = esp_netif_set_hostname(staNetif, DIAGNOSTIC_HOSTNAME);
      if (netifStatus != ESP_OK) {
        Serial.printf("[WiFi] Échec assignation hostname netif (0x%X)\r\n", netifStatus);
      }
    } else {
      Serial.println("[WiFi] Interface STA introuvable pour l'assignation du hostname");
    }
  #elif defined(DIAGNOSTIC_HAS_TCPIP_ADAPTER)
    err_t adapterStatus = tcpip_adapter_set_hostname(TCPIP_ADAPTER_IF_STA, DIAGNOSTIC_HOSTNAME);
    if (adapterStatus != ERR_OK) {
      Serial.printf("[WiFi] Échec assignation hostname TCP/IP (%d)\r\n", static_cast<int>(adapterStatus));
    }
  #endif
#endif
}

void stopMDNSService(const char* reason) {
#if DIAGNOSTIC_HAS_MDNS
  if (!mdnsServiceActive) {
    return;
  }
#if defined(DIAGNOSTIC_USES_ESPMDNS)
  DIAGNOSTIC_MDNS_SERVER.end();
#elif defined(DIAGNOSTIC_USES_IDF_MDNS)
  if (mdnsResponderInitialized) {
    mdns_free();
    mdnsResponderInitialized = false;
  }
#endif
  mdnsServiceActive = false;
  if (reason != nullptr) {
    Serial.printf("[mDNS] Service arrêté (%s)\r\n", reason);
  } else {
    Serial.println("[mDNS] Service arrêté");
  }
#else
  (void) reason;
#endif
}

