morfredus/ESP32-Diagnostic/src/main.cpp
    if (net.bandwidth.length() == 0) net.bandwidth = "-";
    wifiNetworks.push_back(net);
  }

#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 3, 0)
  WiFi.scanDelete();
#endif

  Serial.printf("WiFi: %d reseaux trouves\r\n", n);
}

// ========== TEST GPIO ==========
bool testSingleGPIO(int pin) {
  if (pin == 1 || pin == 3) return false;
  if (pin >= 6 && pin <= 11) return false;
  
  pinMode(pin, OUTPUT);
  digitalWrite(pin, HIGH);
  delayMicroseconds(250);
  bool highOk = digitalRead(pin) == HIGH;

  digitalWrite(pin, LOW);
  delayMicroseconds(250);
  bool lowOk = digitalRead(pin) == LOW;
  
  pinMode(pin, INPUT);
  return highOk && lowOk;
}

void testAllGPIOs() {
  Serial.println("\r\n=== TEST GPIO ===");
  gpioResults.clear();
  
  #ifdef CONFIG_IDF_TARGET_ESP32
    int gpios[] = {0,2,4,5,12,13,14,15,16,17,18,19,21,22,23,25,26,27,32,33};
    int numGPIO = 20;
  #elif defined(CONFIG_IDF_TARGET_ESP32S3)
    int gpios[] = {0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21};
    int numGPIO = 22;
  #elif defined(CONFIG_IDF_TARGET_ESP32C3)
    int gpios[] = {0,1,2,3,4,5,6,7,8,9,10};
    int numGPIO = 11;
  #else
    int gpios[] = {0,2,4,5};
    int numGPIO = 4;
  #endif
  
  for (int i = 0; i < numGPIO; i++) {
    GPIOTestResult result;
    result.pin = gpios[i];
    result.tested = true;
    result.working = testSingleGPIO(gpios[i]);
    result.mode = "Digital I/O";
    // [OPT-009]: Use pre-allocated constants instead of String(Texts::ok/fail)
    result.notes = result.working ? OK_STR : FAIL_STR;
    gpioResults.push_back(result);
  }
  Serial.printf("GPIO: %d testes\r\n", numGPIO);
}

// ========== LED INTÉGRÉE ==========
void detectBuiltinLED() {
  String chipModel = detectChipModel();
  
  // LED intégrée : référence unique
  char ledBuf[96];
  snprintf(ledBuf, sizeof(ledBuf), "%s %d - %s", Texts::gpio.str().c_str(), current_led_builtin, Texts::not_tested.str().c_str());
  builtinLedTestResult = String(ledBuf);
  Serial.printf("LED integree: GPIO %d\r\n", current_led_builtin);
}

void testBuiltinLED() {
  Serial.println("\r\n=== TEST LED ===");
  pinMode(current_led_builtin, OUTPUT);
  for (int i = 0; i < 5; i++) {
    digitalWrite(current_led_builtin, HIGH);
    delay(80);
    digitalWrite(current_led_builtin, LOW);
    delay(80);
  }
  for (int i = 0; i <= 255; i += 51) {
    analogWrite(current_led_builtin, i);
    delay(25);
    yield();
  }
  for (int i = 255; i >= 0; i -= 51) {
    analogWrite(current_led_builtin, i);
    delay(25);
    yield();
  }
  digitalWrite(current_led_builtin, LOW);
  builtinLedAvailable = true;
  char ledBuf[96];
  snprintf(ledBuf, sizeof(ledBuf), "%s %s - GPIO %d", Texts::test.str().c_str(), Texts::ok.str().c_str(), current_led_builtin);
  builtinLedTestResult = String(ledBuf);
  builtinLedTested = true;
  Serial.println("LED: OK");
}

void resetBuiltinLEDTest() {
  builtinLedTested = false;
  builtinLedAvailable = false;
  digitalWrite(current_led_builtin, LOW);
}

// ========== NEOPIXEL ==========
void detectNeoPixelSupport() {
  if (strip != nullptr) delete strip;
  strip = new Adafruit_NeoPixel(current_neopixel_count, current_neopixel, NEO_GRB + NEO_KHZ800);
  char neoBuf[96];
  snprintf(neoBuf, sizeof(neoBuf), "%s %d - %s", Texts::gpio.str().c_str(), current_neopixel, Texts::not_tested.str().c_str());
  neopixelTestResult = String(neoBuf);
  Serial.printf("NeoPixel: GPIO %d\r\n", current_neopixel);
}

void testNeoPixel() {
  if (!strip) return;
  Serial.println("\r\n=== TEST NEOPIXEL ===");
  strip->begin();
  strip->clear();
  strip->show();
  strip->setPixelColor(0, strip->Color(255, 0, 0));
  strip->show();
  delay(160);
  strip->setPixelColor(0, strip->Color(0, 255, 0));
  strip->show();
  delay(160);
  strip->setPixelColor(0, strip->Color(0, 0, 255));
  strip->show();
  delay(160);
  for (int i = 0; i < 256; i += 64) {
    strip->setPixelColor(0, strip->gamma32(strip->ColorHSV(i * 256)));
    strip->show();
    delay(28);
    yield();
  }
  strip->clear();
  strip->show();
  neopixelAvailable = true;
  char neoBuf[96];
  snprintf(neoBuf, sizeof(neoBuf), "%s %s - GPIO %d", Texts::test.str().c_str(), Texts::ok.str().c_str(), current_neopixel);
  neopixelTestResult = String(neoBuf);
  neopixelTested = true;
  Serial.println("NeoPixel: OK");
}

void resetNeoPixelTest() {
  neopixelTested = false;
  neopixelAvailable = false;
  if (strip) {
    strip->clear();
    strip->show();
  }
}

static inline bool neopixelReady() {
  return strip != nullptr;
}

void neopixelPauseStatus() {
  neopixelStatusPaused = true;
}

void neopixelResumeStatus() {
  neopixelStatusPaused = false;
  neopixelStatusKnown = false;
  neopixelConnecting = false;
}

void neopixelShowConnecting() {
  if (!neopixelReady() || neopixelStatusPaused) return;
  neopixelConnecting = true;
  strip->setBrightness(60);
  strip->setPixelColor(0, strip->Color(50, 50, 0)); // Jaune fixe pendant la connexion
  strip->show();
}

void neopixelSetWifiState(bool connected) {
  if (!neopixelReady() || neopixelStatusPaused) return;
  neopixelConnecting = false;
  neopixelLastWifiConnected = connected;
  neopixelStatusKnown = true;
  neopixelHeartbeatPreviousMillis = millis();
  neopixelHeartbeatState = false;
  strip->setBrightness(60);
  strip->setPixelColor(0, connected ? strip->Color(0, 50, 0) : strip->Color(50, 0, 0));
  strip->show();
}

void updateNeoPixelWifiStatus() {
  if (!neopixelReady() || neopixelStatusPaused) return;
  if (neopixelConnecting) return; // Couleur fixe tant que la connexion est en cours

  bool connected = (WiFi.status() == WL_CONNECTED);

  if (!neopixelStatusKnown || connected != neopixelLastWifiConnected) {
    neopixelSetWifiState(connected);
    return;
  }

  unsigned long now = millis();
  if (now - neopixelHeartbeatPreviousMillis >= NEOPIXEL_HEARTBEAT_INTERVAL_MS) {
    neopixelHeartbeatPreviousMillis = now;
    neopixelHeartbeatState = !neopixelHeartbeatState;
    uint32_t color = connected
      ? (neopixelHeartbeatState ? strip->Color(0, 50, 0) : strip->Color(0, 10, 0))
      : (neopixelHeartbeatState ? strip->Color(50, 0, 0) : strip->Color(10, 0, 0));
    strip->setPixelColor(0, color);
    strip->show();
  }
}

void neopixelRestoreWifiStatus() {
  neopixelResumeStatus();
  updateNeoPixelWifiStatus();
}

