morfredus/ESP32-Diagnostic/src/main.cpp
  delay(500);
#endif
}

void tftStepFinal() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) return;
  
  tft.fillScreen(TFT_BLACK);
  
  tft.setTextColor(TFT_GREEN);
  tft.setTextSize(3);
  tft.setCursor(40, 80);
  tft.println("TEST");
  tft.setCursor(20, 120);
  tft.println("COMPLETE!");
  
  // Success indicator
  tft.fillCircle(120, 180, 20, TFT_GREEN);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(3);
  tft.setCursor(108, 172);
  tft.print("OK");
  
  delay(2000);
#endif
}

bool performTFTStep(const String &stepId) {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) {
    return false;
  }

  if (stepId == "boot") {
    tftStepBoot();
  } else if (stepId == "colors") {
    tftStepColors();
  } else if (stepId == "shapes") {
    tftStepShapes();
  } else if (stepId == "text") {
    tftStepText();
  } else if (stepId == "lines") {
    tftStepLines();
  } else if (stepId == "animation") {
    tftStepAnimation();
  } else if (stepId == "progress") {
    tftStepProgressBar();
  } else if (stepId == "final") {
    tftStepFinal();
  } else {
    return false;
  }

  return true;
#else
  return false;
#endif
}

String getTFTStepLabel(const String &stepId) {
  if (stepId == "boot") return "Boot Screen";
  if (stepId == "colors") return "Colors";
  if (stepId == "shapes") return "Shapes";
  if (stepId == "text") return "Text";
  if (stepId == "lines") return "Lines";
  if (stepId == "animation") return "Animation";
  if (stepId == "progress") return "Progress Bar";
  if (stepId == "final") return "Final Message";
  return stepId;
}

void testTFT() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) {
    tftTestResult = String(Texts::not_available);
    return;
  }

  Serial.println("\r\n=== TEST TFT ===");

  tftStepBoot();
  tftStepColors();
  tftStepShapes();
  tftStepText();
  tftStepLines();
  tftStepAnimation();
  tftStepProgressBar();
  tftStepFinal();

  tftTestResult = "OK - Tests complets";
  Serial.println("TFT: Tests complets OK\r\n");
#endif
}

// ========== TEST ADC ==========
void testADC() {
  Serial.println("\r\n=== TEST ADC ===");
  adcReadings.clear();
  
  #ifdef CONFIG_IDF_TARGET_ESP32
    int adcPins[] = {36, 39, 34, 35, 32, 33};
    int numADC = 6;
  #elif defined(CONFIG_IDF_TARGET_ESP32S3)
    int adcPins[] = {1, 2, 3, 4, 5, 6};
    int numADC = 6;
  #elif defined(CONFIG_IDF_TARGET_ESP32C3)
    int adcPins[] = {0, 1, 2, 3, 4};
    int numADC = 5;
  #else
    int adcPins[] = {36, 39};
    int numADC = 2;
  #endif

  for (int i = 0; i < numADC; i++) {
    ADCReading reading;
    reading.pin = adcPins[i];
    reading.rawValue = analogRead(adcPins[i]);
    reading.voltage = (reading.rawValue / 4095.0) * 3.3;
    adcReadings.push_back(reading);

    Serial.printf("GPIO%d: %d (%.2fV)\r\n", reading.pin, reading.rawValue, reading.voltage);
  }
  
  // [OPT-009]: Buffer-based test result (1 vs 4 allocations)
  char adcBuf[96];
  snprintf(adcBuf, sizeof(adcBuf), "%d %s - %s", numADC, Texts::channels.str().c_str(), Texts::ok.str().c_str());
  adcTestResult = String(adcBuf);
  Serial.printf("ADC: %d canaux testes\r\n", numADC);
}

// ========== TEST PWM ==========
void testPWM() {
  Serial.println("\r\n=== TEST PWM ===");
  int testPin = 2;

  #ifdef CONFIG_IDF_TARGET_ESP32S3
    testPin = 48;
  #elif defined(CONFIG_IDF_TARGET_ESP32C3)
    testPin = 8;
  #endif

  Serial.printf("Test PWM sur GPIO%d\r\n", testPin);

  // --- [PLATFORMIO FIX] Use legacy LEDC API for PlatformIO compatibility ---
  uint8_t pwmChannel = 0;
  ledcSetup(pwmChannel, 5000, 8);       // channel, freq, resolution
  ledcAttachPin(testPin, pwmChannel);    // pin, channel

  for (int duty = 0; duty <= 255; duty += 51) {
    ledcWrite(pwmChannel, duty);         // channel, duty
    Serial.printf("PWM duty: %d/255\r\n", duty);
    delay(80);
    yield();
  }

  ledcWrite(pwmChannel, 0);
  ledcDetachPin(testPin);                // pin

  // [OPT-009]: Buffer-based test result (1 vs 4 allocations)
  char pwmBuf[96];
  snprintf(pwmBuf, sizeof(pwmBuf), "%s %s - GPIO %d", Texts::test.str().c_str(), Texts::ok.str().c_str(), testPin);
  pwmTestResult = String(pwmBuf);
  Serial.println("PWM: OK");
}

// ========== SCAN SPI ==========
void scanSPI() {
  Serial.println("\r\n=== SCAN SPI ===");
  spiInfo = "";
  
  #ifdef CONFIG_IDF_TARGET_ESP32
    spiInfo = "HSPI (12,13,14,15), VSPI (18,19,23,5)";
    Serial.println("SPI: HSPI + VSPI disponibles");
  #elif defined(CONFIG_IDF_TARGET_ESP32S2)
    spiInfo = "SPI2, SPI3 disponibles";
    Serial.println("SPI: SPI2, SPI3");
  #elif defined(CONFIG_IDF_TARGET_ESP32S3)
    spiInfo = "SPI2, SPI3 disponibles";
    Serial.println("SPI: SPI2, SPI3");
  #elif defined(CONFIG_IDF_TARGET_ESP32C3)
    spiInfo = "SPI2 disponible";
    Serial.println("SPI: SPI2");
  #else
    spiInfo = "Info SPI non disponible";
  #endif
}

// ========== LISTING PARTITIONS ==========
void listPartitions() {
  Serial.println("\r\n=== PARTITIONS FLASH ===");
  partitionsInfo = "";
  
  esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, NULL);
  
  int count = 0;
  while (it != NULL) {
    const esp_partition_t *part = esp_partition_get(it);
    
    char line[128];
    sprintf(line, "%s - Type:0x%02x Addr:0x%08x Size:%dKB", 
            part->label, part->type, part->address, part->size / 1024);
    
    if (count > 0) partitionsInfo += "\r\n";
    partitionsInfo += String(line);
    
    Serial.println(line);
    
    it = esp_partition_next(it);
    count++;
  }
  
  esp_partition_iterator_release(it);
  Serial.printf("Total: %d partitions\r\n", count);
}

// TEST LED RGB
void testRGBLed() {
  Serial.println("\r\n=== TEST LED RGB ===");


  pinMode(current_rgb_r, OUTPUT);
  pinMode(current_rgb_g, OUTPUT);
  pinMode(current_rgb_b, OUTPUT);

  Serial.printf("Test LED RGB - R:%d G:%d B:%d\r\n", current_rgb_r, current_rgb_g, current_rgb_b);

  digitalWrite(current_rgb_r, LOW);
  digitalWrite(current_rgb_g, LOW);
  digitalWrite(current_rgb_b, LOW);
  delay(120);

  digitalWrite(current_rgb_r, HIGH);
  delay(150);
  digitalWrite(current_rgb_r, LOW);

