morfredus/ESP32-Diagnostic/src/main.cpp
  digitalWrite(current_rgb_g, HIGH);
  delay(150);
  digitalWrite(current_rgb_g, LOW);

  digitalWrite(current_rgb_b, HIGH);
  delay(150);
  digitalWrite(current_rgb_b, LOW);

  rgbLedTestResult = OK_STR;
  rgbLedAvailable = true;
  Serial.println("LED RGB: OK");
}

void setRGBLedColor(int r, int g, int b) {
  analogWrite(current_rgb_r, r);
  analogWrite(current_rgb_g, g);
  analogWrite(current_rgb_b, b);
}

// TEST BUZZER
void testBuzzer() {
  Serial.println("\r\n=== TEST BUZZER ===");


  pinMode(BUZZER, OUTPUT);
  Serial.printf("Test Buzzer - Pin:%d\r\n", BUZZER);

  tone(BUZZER, 1000, 160);
  delay(220);
  tone(BUZZER, 1500, 160);
  delay(220);
  tone(BUZZER, 2000, 160);
  delay(220);
  noTone(BUZZER);

  buzzerTestResult = OK_STR;
  buzzerAvailable = true;
  Serial.println("Buzzer: OK");
}

void playBuzzerTone(int frequency, int duration) {
  tone(BUZZER, frequency, duration);
}

// DHT sensor helpers
static inline const char* getDhtSensorName() {
  return "DHT";
}

// TEST DHT SENSOR
void testDHTSensor() {
  const char* sensorName = getDhtSensorName();
  Serial.printf("\r\n=== TEST %s ===\r\n", sensorName);

  pinMode(DHT, OUTPUT);
  digitalWrite(DHT, LOW);
  delay(20);
  digitalWrite(DHT, HIGH);
  delayMicroseconds(40);
  pinMode(DHT, INPUT_PULLUP);

  // Simulation de lecture (à adapter selon le capteur réel)
  dhtHumidity = 50.0f;
  dhtTemperature = 22.0f;
  dhtTestResult = OK_STR;
  dhtAvailable = true;
  Serial.printf("%s: T=%.1f°C H=%.1f%%\r\n", sensorName, dhtTemperature, dhtHumidity);
}

// TEST LIGHT SENSOR
void testLightSensor() {
  Serial.println("\r\n=== TEST LIGHT SENSOR ===");

  pinMode(current_light_sensor, INPUT);
  Serial.printf("Lecture Light Sensor - Pin:%d\r\n", current_light_sensor);

  int sum = 0;
  const int samples = 6;
  for (int i = 0; i < samples; i++) {
    sum += analogRead(current_light_sensor);
    delay(8);
    yield();
  }
  lightSensorValue = sum / samples;

  lightSensorTestResult = OK_STR;
  lightSensorAvailable = true;
  Serial.printf("Light Sensor: %d\r\n", lightSensorValue);
}

// TEST DISTANCE SENSOR
void testDistanceSensor() {
  Serial.println("\r\n=== TEST DISTANCE SENSOR (HC-SR04) ===");


  pinMode(current_distance_trig, OUTPUT);
  pinMode(current_distance_echo, INPUT);

  Serial.printf("Distance Sensor - Trig:%d Echo:%d\r\n", current_distance_trig, current_distance_echo);

  // Assurer ECHO à LOW avant de déclencher (éviter faux négatifs)
  {
    unsigned long waitStart = micros();
    while (digitalRead(current_distance_echo) == HIGH && (micros() - waitStart) < 200000UL) {
      yield();
    }
  }

  // Séquence TRIG: 10 µs HIGH après stabilisation LOW
  digitalWrite(current_distance_trig, LOW);
  delayMicroseconds(4);
  digitalWrite(current_distance_trig, HIGH);
  delayMicroseconds(10);
  digitalWrite(current_distance_trig, LOW);

  // Mesure de l'impulsion ECHO (timeout élargi)
  unsigned long timeoutUs = 60000UL; // 60 ms
  unsigned long duration = 0UL;
#if defined(ARDUINO_ARCH_ESP32)
  duration = pulseInLong(current_distance_echo, HIGH, timeoutUs);
#else
  duration = pulseIn(current_distance_echo, HIGH, timeoutUs);
#endif

  if (duration > 0UL) {
    // Vitesse du son ~0.034 cm/µs ; aller-retour => /2
    distanceValue = (double)duration * 0.034 / 2.0;
    distanceSensorTestResult = OK_STR;
    distanceSensorAvailable = true;
    Serial.printf("Distance: %.2f cm\r\n", distanceValue);
  } else {
    distanceSensorTestResult = String(Texts::error_label);
    distanceSensorAvailable = false;
    Serial.println("Distance Sensor: No echo (check wiring/level shifting/target distance)");
  }
}

// TEST MOTION SENSOR
void testMotionSensor() {
  Serial.println("\r\n=== TEST MOTION SENSOR (PIR) ===");

  pinMode(current_motion_sensor, INPUT);
  Serial.printf("Motion Sensor - Pin:%d\r\n", current_motion_sensor);

  delay(30);
  yield();
  motionDetected = digitalRead(current_motion_sensor);

  motionSensorTestResult = OK_STR;
  motionSensorAvailable = true;
  Serial.printf("Motion: %s\r\n", motionDetected ? "Detected" : "None");
}

// ========== TEST STRESS MÉMOIRE ==========
void memoryStressTest() {
  Serial.println("\r\n=== STRESS TEST MEMOIRE ===");
  
  unsigned long startMs = millis();
  stressAllocationCount = 0;
  stressDurationMs = 0;

  const int allocSize = 1024;
  int maxAllocs = 0;
  std::vector<void*> allocations;
  
  Serial.println("Allocation progressive...");
  while(true) {
    void* ptr = malloc(allocSize);
    if (!ptr) break;
    allocations.push_back(ptr);
    maxAllocs++;
    
    if (maxAllocs % 100 == 0) {
      Serial.printf("Alloue: %d KB\r\n", maxAllocs);
    }
  }
  
  Serial.printf("Max allocations: %d blocs (%d KB)\r\n", maxAllocs, maxAllocs);


  Serial.println("Liberation memoire...");
  for (auto ptr : allocations) {
    free(ptr);
  }

  stressAllocationCount = maxAllocs;
  stressDurationMs = millis() - startMs;

  stressTestResult = String(Texts::max_alloc) + ": " + String(maxAllocs) + " KB";
  Serial.println("Stress test: OK");
}

// ========== COLLECTE DONNÉES ==========
void collectDiagnosticInfo() {
  esp_chip_info_t chip_info;
  esp_chip_info(&chip_info);
  
  diagnosticData.chipModel = detectChipModel();
  diagnosticData.chipRevision = String(chip_info.revision);
  diagnosticData.cpuCores = chip_info.cores;
  diagnosticData.cpuFreqMHz = ESP.getCpuFreqMHz();
  
  uint32_t flash_size;
  esp_flash_get_size(NULL, &flash_size);
  diagnosticData.flashSize = flash_size;
  diagnosticData.psramSize = ESP.getPsramSize();
  
  uint8_t mac[6];
  esp_read_mac(mac, ESP_MAC_WIFI_STA);
  char macStr[18];
  sprintf(macStr, "%02X:%02X:%02X:%02X:%02X:%02X", 
          mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  diagnosticData.macAddress = String(macStr);
  
  diagnosticData.heapSize = ESP.getHeapSize();
  diagnosticData.freeHeap = ESP.getFreeHeap();
  diagnosticData.minFreeHeap = ESP.getMinFreeHeap();
  diagnosticData.maxAllocHeap = ESP.getMaxAllocHeap();
  
  diagnosticData.hasWiFi = (chip_info.features & CHIP_FEATURE_WIFI_BGN);
  diagnosticData.hasBT = (chip_info.features & CHIP_FEATURE_BT);
  bool featureBLE = (chip_info.features & CHIP_FEATURE_BLE);

#ifdef CHIP_ESP32S2
  if (chip_info.model == CHIP_ESP32S2) {
    runtimeBLE = false;
  }
#endif
#ifdef CHIP_ESP32S3
  if (chip_info.model == CHIP_ESP32S3) {
    runtimeBLE = true;
  }
#endif
#ifdef CHIP_ESP32C3
  if (chip_info.model == CHIP_ESP32C3) {
    runtimeBLE = true;
  }
#endif
#ifdef CHIP_ESP32C6
  if (chip_info.model == CHIP_ESP32C6) {
    runtimeBLE = true;
  }
#endif
#ifdef CHIP_ESP32H2
  if (chip_info.model == CHIP_ESP32H2) {
    runtimeBLE = true;
  }
#endif

  if (WiFi.status() == WL_CONNECTED) {
    diagnosticData.wifiSSID = WiFi.SSID();
    diagnosticData.wifiRSSI = WiFi.RSSI();
    diagnosticData.ipAddress = WiFi.localIP().toString();
#if DIAGNOSTIC_HAS_MDNS
    diagnosticData.mdnsAvailable = mdnsServiceActive;
#else
    diagnosticData.mdnsAvailable = false;
#endif
  } else {
    diagnosticData.wifiSSID = "";
    diagnosticData.wifiRSSI = -127;
    diagnosticData.ipAddress = "";
    diagnosticData.mdnsAvailable = false;
  }
  
  diagnosticData.gpioList = getGPIOList();
  diagnosticData.totalGPIO = countGPIO();
  
