morfredus/ESP32-Diagnostic/src/main.cpp
  if (alreadyRunning) {
    sendActionResponse(200, true, String(Texts::test_in_progress), {
      jsonBoolField("running", true),
      jsonBoolField("available", neopixelAvailable),
      jsonStringField("result", neopixelTestResult)
    });
    return;
  }

  neopixelPauseStatus();
  resetNeoPixelTest();
  testNeoPixel();
  neopixelRestoreWifiStatus();
  sendActionResponse(200, neopixelAvailable, neopixelTestResult, {
    jsonBoolField("running", false),
    jsonBoolField("available", neopixelAvailable),
    jsonStringField("result", neopixelTestResult)
  });
}

void handleNeoPixelPattern() {
  if (!server.hasArg("pattern")) {
    sendOperationError(400, Texts::configuration_invalid.str());
    return;
  }

  String pattern = server.arg("pattern");
  if (!strip) {
    String message = String(Texts::neopixel) + " - " + String(Texts::not_detected);
    sendOperationError(400, message);
    return;
  }

  neopixelPauseStatus();
  String message;
  if (pattern == "rainbow") {
    neopixelRainbow();
    char msgBuf[96];
    snprintf(msgBuf, sizeof(msgBuf), "%s %s", Texts::rainbow.str().c_str(), Texts::ok.str().c_str());
    message = String(msgBuf);
  } else if (pattern == "blink") {
    neopixelBlink(strip->Color(255, 0, 0), 5);
    // [OPT-009]: Buffer-based message (1 vs 2 allocations)
    char msgBuf[96];
    snprintf(msgBuf, sizeof(msgBuf), "%s %s", Texts::blink.str().c_str(), Texts::ok.str().c_str());
    message = String(msgBuf);
  } else if (pattern == "fade") {
    neopixelFade(strip->Color(0, 0, 255));
    // [OPT-009]: Buffer-based message (1 vs 2 allocations)
    char msgBuf[96];
    snprintf(msgBuf, sizeof(msgBuf), "%s %s", Texts::fade.str().c_str(), Texts::ok.str().c_str());
    message = String(msgBuf);
  } else if (pattern == "chase") {
    neopixelChase();
    char msgBuf[96];
    snprintf(msgBuf, sizeof(msgBuf), "%s %s", Texts::chase.str().c_str(), Texts::ok.str().c_str());
    message = String(msgBuf);
  } else if (pattern == "off") {
    strip->clear();
    strip->show();
    neopixelTested = false;
    message = String(Texts::off);
  } else {
    sendOperationError(400, Texts::configuration_invalid.str());
    neopixelRestoreWifiStatus();
    return;
  }

  neopixelRestoreWifiStatus();
  sendOperationSuccess(message);
}

void handleNeoPixelColor() {
  if (!server.hasArg("r") || !server.hasArg("g") || !server.hasArg("b") || !strip) {
    sendOperationError(400, Texts::configuration_invalid.str());
    return;
  }

  int r = server.arg("r").toInt();
  int g = server.arg("g").toInt();
  int b = server.arg("b").toInt();

  strip->fill(strip->Color(r, g, b));
  strip->show();
  neopixelTested = false;

  String message = "RGB(" + String(r) + "," + String(g) + "," + String(b) + ")";
  sendOperationSuccess(message);
}

void handleOLEDConfig() {
  if (server.hasArg("sda") && server.hasArg("scl") && server.hasArg("rotation")) {
    int newSDA = server.arg("sda").toInt();
    int newSCL = server.arg("scl").toInt();
    int newRotation = server.arg("rotation").toInt();
    
    // Optional resolution parameters
    int newWidth = server.hasArg("width") ? server.arg("width").toInt() : oledWidth;
    int newHeight = server.hasArg("height") ? server.arg("height").toInt() : oledHeight;

    if (newSDA >= 0 && newSDA <= 48 && newSCL >= 0 && newSCL <= 48 && newRotation >= 0 && newRotation <= 3) {
      bool pinsChanged = (I2C_SDA != newSDA) || (I2C_SCL != newSCL);
      bool rotationChanged = (oledRotation != static_cast<uint8_t>(newRotation));
      bool resolutionChanged = (oledWidth != newWidth) || (oledHeight != newHeight);

      /* I2C_SDA = newSDA; */ /* I2C_SCL = newSCL; */ // Totalement commenté pour éviter toute référence
      oledRotation = static_cast<uint8_t>(newRotation);
      oledWidth = newWidth;
      oledHeight = newHeight;

      if (pinsChanged || rotationChanged || resolutionChanged) {
        resetOLEDTest();
        Wire.end();
        detectOLED();
      } else if (oledAvailable) {
        applyOLEDOrientation();
      }

      // [OPT-007]: Buffer-based message formatting to reduce allocations (1 vs 9)
      char messageBuffer[128];
      snprintf(messageBuffer, sizeof(messageBuffer), "I2C reconfigure: SDA:%d SCL:%d Rot:%d Res:%dx%d", 
               I2C_SDA, I2C_SCL, oledRotation, oledWidth, oledHeight);
      sendOperationSuccess(String(messageBuffer), {
        jsonNumberField("sda", I2C_SDA),
        jsonNumberField("scl", I2C_SCL),
        jsonNumberField("rotation", oledRotation),
        jsonNumberField("width", oledWidth),
        jsonNumberField("height", oledHeight)
      });
      return;
    }
  }
  sendOperationError(400, Texts::configuration_invalid.str());
}

void handleOLEDTest() {
  bool alreadyRunning = false;
  bool started = startAsyncTest(oledTestRunner, runOledTestTask, alreadyRunning, 6144, 1);

  if (started) {
    sendActionResponse(202, true, String(Texts::test_in_progress), {
      jsonBoolField("running", true),
      jsonBoolField("available", oledAvailable),
      jsonStringField("result", oledTestResult)
    });
    return;
  }

  if (alreadyRunning) {
    sendActionResponse(200, true, String(Texts::test_in_progress), {
      jsonBoolField("running", true),
      jsonBoolField("available", oledAvailable),
      jsonStringField("result", oledTestResult)
    });
    return;
  }

  resetOLEDTest();
  testOLED();
  sendActionResponse(200, oledAvailable, oledTestResult, {
    jsonBoolField("running", false),
    jsonBoolField("available", oledAvailable),
    jsonStringField("result", oledTestResult)
  });
}

void handleOLEDStep() {
  if (!server.hasArg("step")) {
    sendOperationError(400, Texts::oled_step_unknown.str());
    return;
  }

  String stepId = server.arg("step");

  if (!oledAvailable) {
    sendActionResponse(200, false, Texts::oled_step_unavailable.str());
    return;
  }

  bool ok = performOLEDStep(stepId);
  if (!ok) {
    sendOperationError(400, Texts::oled_step_unknown.str());
    return;
  }

  String label = getOLEDStepLabel(stepId);
  // [OPT-007]: Buffer-based message formatting (1 vs 2 allocations)
  char msgBuf[256];
  snprintf(msgBuf, sizeof(msgBuf), "%s %s", Texts::oled_step_executed_prefix.str().c_str(), label.c_str());
  sendOperationSuccess(String(msgBuf));
}

void handleOLEDMessage() {
  if (!server.hasArg("message")) {
    sendOperationError(400, Texts::configuration_invalid.str());
    return;
  }

  String message = server.arg("message");
  oledShowMessage(message);
  // Use translation key instead of hardcoded string
  sendOperationSuccess(Texts::message_displayed.str());
}

void handleOLEDBoot() {
  if (!oledAvailable) {
    sendActionResponse(200, false, "OLED not available");
    return;
  }

  oledShowWiFiStatus(PROJECT_NAME, "System Ready", WiFi.localIP().toString(), 100);
  sendOperationSuccess("Boot screen displayed");
}

void handleTFTTest() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) {
    sendActionResponse(200, false, "TFT not available", {
      jsonBoolField("available", false)
    });
    return;
  }

  testTFT();
  sendActionResponse(200, true, "TFT test complete", {
    jsonBoolField("available", true)
  });
#else
  sendActionResponse(200, false, "TFT not enabled", {
    jsonBoolField("available", false)
  });
#endif
}

void handleTFTStep() {
#if ENABLE_TFT_DISPLAY
  if (!server.hasArg("step")) {
    sendOperationError(400, "Step parameter missing");
    return;
  }

