morfredus/ESP32-Diagnostic/src/main.cpp
void handleRGBLedColor() {
  if (server.hasArg("r") && server.hasArg("g") && server.hasArg("b")) {
    int r = server.arg("r").toInt();
    int g = server.arg("g").toInt();
    int b = server.arg("b").toInt();
    setRGBLedColor(r, g, b);
    sendActionResponse(200, true, "RGB(" + String(r) + "," + String(g) + "," + String(b) + ")");
  } else {
    sendActionResponse(400, false, String(Texts::configuration_invalid));
  }
}

void handleBuzzerConfig() {
  // Modification dynamique désactivée : la pin buzzer est fixée par board_config.h
  sendActionResponse(403, false, "Modification de la pin buzzer interdite. Voir board_config.h");
}

void handleBuzzerTest() {
  bool alreadyRunning = false;
  bool started = startAsyncTest(buzzerTestRunner, runBuzzerTestTask, alreadyRunning, 3072, 1);

  if (started) {
    sendJsonResponse(202, {
      jsonBoolField("running", true),
      jsonBoolField("success", buzzerAvailable),
      jsonStringField("result", buzzerTestResult)
    });
    return;
  }

  if (alreadyRunning) {
    sendJsonResponse(200, {
      jsonBoolField("running", true),
      jsonBoolField("success", buzzerAvailable),
      jsonStringField("result", buzzerTestResult)
    });
    return;
  }

  testBuzzer();
  sendJsonResponse(200, {
    jsonBoolField("running", false),
    jsonBoolField("success", buzzerAvailable),
    jsonStringField("result", buzzerTestResult)
  });
}

void handleBuzzerTone() {
  if (server.hasArg("freq") && server.hasArg("duration")) {
    int freq = server.arg("freq").toInt();
    int duration = server.arg("duration").toInt();
    playBuzzerTone(freq, duration);
    sendActionResponse(200, true, String(freq) + "Hz");
  } else {
    sendActionResponse(400, false, String(Texts::configuration_invalid));
  }
}

void handleDHTConfig() {
  // Modification dynamique désactivée : la pin DHT et le type sont fixés par board_config.h
  sendActionResponse(403, false, "Modification de la pin/type DHT interdite. Voir board_config.h");
}

void handleDHTTest() {
  testDHTSensor();
  sendJsonResponse(200, {
    jsonBoolField("success", dhtAvailable),
    jsonStringField("result", dhtTestResult),
    jsonFloatField("temperature", dhtTemperature, 1),
    jsonFloatField("humidity", dhtHumidity, 1),
    // Type DHT fixe par board_config.h, champ supprimé
  });
}

void handleLightSensorConfig() {
  if (server.hasArg("pin")) {
    /*
    LIGHT_SENSOR_PIN = server.arg("pin").toInt();
    */
    // [OPT-009]: Use OK_STR constant instead of String(Texts::ok)
    sendActionResponse(200, true, OK_STR);
  } else {
    sendActionResponse(400, false, String(Texts::configuration_invalid));
  }
}

void handleLightSensorTest() {
  testLightSensor();
  sendJsonResponse(200, {
    jsonBoolField("success", lightSensorAvailable),
    jsonStringField("result", lightSensorTestResult),
    jsonNumberField("value", lightSensorValue)
  });
}

void handleDistanceSensorConfig() {
  if (server.hasArg("trig") && server.hasArg("echo")) {
    /*
    DISTANCE_TRIG_PIN = server.arg("trig").toInt();
    DISTANCE_ECHO_PIN = server.arg("echo").toInt();
    */
    // [OPT-009]: Use OK_STR constant instead of String(Texts::ok)
    sendActionResponse(200, true, OK_STR);
  } else {
    sendActionResponse(400, false, String(Texts::configuration_invalid));
  }
}

void handleDistanceSensorTest() {
  testDistanceSensor();
  sendJsonResponse(200, {
    jsonBoolField("success", distanceSensorAvailable),
    jsonStringField("result", distanceSensorTestResult),
    jsonFloatField("distance", distanceValue, 2)
  });
}

void handleMotionSensorConfig() {
  if (server.hasArg("pin")) {
    /*
    MOTION_SENSOR_PIN = server.arg("pin").toInt();
    */
    // [OPT-009]: Use OK_STR constant instead of String(Texts::ok)
    sendActionResponse(200, true, OK_STR);
  } else {
    sendActionResponse(400, false, String(Texts::configuration_invalid));
  }
}

void handleMotionSensorTest() {
  testMotionSensor();
  sendJsonResponse(200, {
    jsonBoolField("success", motionSensorAvailable),
    jsonStringField("result", motionSensorTestResult),
    jsonBoolField("motion", motionDetected)
  });
}

// GPS Handlers
void handleGPSData() {
  updateGPS();
  String json;
  json.reserve(400);
  json = "{";
  json += "\"valid\":" + String(gpsData.valid ? "true" : "false") + ",";
  json += "\"hasFix\":" + String(gpsData.hasFix ? "true" : "false") + ",";
  json += "\"latitude\":" + String(gpsData.latitude, 6) + ",";
  json += "\"longitude\":" + String(gpsData.longitude, 6) + ",";
  json += "\"altitude\":" + String(gpsData.altitude, 2) + ",";
  json += "\"satellites\":" + String(gpsData.satellites) + ",";
  json += "\"satellites_used\":" + String(gpsData.satellites_used) + ",";
  json += "\"hdop\":" + String(gpsData.hdop, 2) + ",";
  json += "\"speed\":" + String(gpsData.speed, 2) + ",";
  json += "\"course\":" + String(gpsData.course, 2) + ",";
  json += "\"fix_type\":\"" + gpsData.fix_type + "\",";
  json += "\"status\":\"" + gpsData.status_str + "\",";
  json += "\"time\":\"" + String(gpsData.hour) + ":" + String(gpsData.minute) + ":" + String(gpsData.second) + "\",";
  json += "\"date\":\"" + String(gpsData.day) + "/" + String(gpsData.month) + "/" + String(gpsData.year) + "\"";
  json += "}";
  
  server.send(200, "application/json", json);
}

void handleGPSTest() {
  testGPS();
  String json;
  json.reserve(200);
  json = "{";
  json += "\"success\":" + String(gpsAvailable ? "true" : "false") + ",";
  json += "\"result\":\"" + gpsTestResult + "\",";
  json += "\"available\":" + String(gpsAvailable ? "true" : "false");
  json += "}";
  
  server.send(200, "application/json", json);
}

// Environmental Sensors Handlers
void handleEnvironmentalSensors() {
  updateEnvironmentalSensors();
  String json;
  json.reserve(400);
  json = "{";
  json += "\"aht20_available\":" + String(envData.aht20_available ? "true" : "false") + ",";
  json += "\"bmp280_available\":" + String(envData.bmp280_available ? "true" : "false") + ",";
  json += "\"temperature_avg\":" + String(envData.temperature_avg, 1) + ",";
  json += "\"humidity\":" + String(envData.humidity, 1) + ",";
  json += "\"pressure\":" + String(envData.pressure, 2) + ",";
  json += "\"altitude\":" + String(envData.altitude, 1) + ",";
  json += "\"aht20_temp\":" + String(envData.temperature_aht20, 1) + ",";
  json += "\"bmp280_temp\":" + String(envData.temperature_bmp280, 1) + ",";
  json += "\"aht20_status\":\"" + envData.aht20_status + "\",";
  json += "\"bmp280_status\":\"" + envData.bmp280_status + "\",";
  json += "\"combined_status\":\"" + envData.combined_status + "\"";
  json += "}";
  
  server.send(200, "application/json", json);
}

