morfredus/ESP32-Diagnostic/src/main.cpp
static inline void appendJsonField(String& json, bool& first, const JsonFieldSpec& field) {
  if (!first) {
    json += ',';
  }
  first = false;
  json += '"';
  json += field.key;
  json += '"';
  json += ':';
  if (field.raw) {
    json += field.value;
  } else {
    json += '"';
    json += jsonEscape(field.value.c_str());
    json += '"';
  }
}

String buildJsonObject(std::initializer_list<JsonFieldSpec> fields) {
  String json;
  json.reserve(fields.size() * 50 + 10);  // Estimate size based on field count
  json = "{";
  bool first = true;
  for (const auto& field : fields) {
    appendJsonField(json, first, field);
  }
  json += '}';
  return json;
}

inline void sendJsonResponse(int statusCode, std::initializer_list<JsonFieldSpec> fields) {
  server.send(statusCode, "application/json", buildJsonObject(fields));
}

static String buildActionResponseJson(bool success,
                                      const String& message,
                                      std::initializer_list<JsonFieldSpec> extraFields) {
  String json;
  json.reserve(extraFields.size() * 50 + message.length() + 50);  // Estimate size
  json = "{";
  bool first = true;
  appendJsonField(json, first, jsonBoolField("success", success));
  if (message.length() > 0) {
    appendJsonField(json, first, jsonStringField("message", message));
  }
  for (const auto& field : extraFields) {
    appendJsonField(json, first, field);
  }
  json += '}';
  return json;
}

inline void sendActionResponse(int statusCode,
                               bool success,
                               const String& message,
                               std::initializer_list<JsonFieldSpec> extraFields) {
  server.send(statusCode, "application/json", buildActionResponseJson(success, message, extraFields));
}

inline void sendOperationSuccess(const String& message,
                                 std::initializer_list<JsonFieldSpec> extraFields) {
  sendActionResponse(200, true, message, extraFields);
}

inline void sendOperationError(int statusCode,
                               const String& message,
                               std::initializer_list<JsonFieldSpec> extraFields) {
  sendActionResponse(statusCode, false, message, extraFields);
}

static inline void appendInfoItem(String& chunk,
                                  const char* labelKey,
                                  const char* labelText,
                                  const String& valueText,
                                  const String& valueAttrs = String(),
                                  const String& wrapperAttrs = String()) {
  chunk += F("<div class='info-item'");
  if (wrapperAttrs.length() > 0) {
    chunk += ' ';
    chunk += wrapperAttrs;
  }
  chunk += F("><div class='info-label");
  if (labelKey != nullptr && labelKey[0] != '\0') {
    chunk += F(" data-i18n='");
    chunk += labelKey;
    chunk += F("'>");
  } else {
    chunk += F("'>");
  }
  chunk += labelText;
  chunk += F("</div><div class='info-value'");
  if (valueAttrs.length() > 0) {
    chunk += ' ';
    chunk += valueAttrs;
  }
  chunk += F(">");
  chunk += valueText;
  chunk += F("</div></div>");
}

// Dynamic bilingual string export for the web interface
String buildTranslationsJSON(Language lang) {
  String json;
  json.reserve(20000);
  json += '{';
  bool first = true;
  size_t count = 0;
  const Texts::ResourceEntry* const entries = Texts::getResourceEntries(count);
  for (size_t i = 0; i < count; ++i) {
    const Texts::ResourceEntry& entry = entries[i];
    if (entry.field == nullptr) {
      continue;
    }
    if (!first) {
      json += ',';
    }
    first = false;
    json += '"';
    json += entry.key;
    json += F("\":\"");
    const __FlashStringHelper* raw = entry.field->get(lang);
    String fieldValue;
    if (raw != nullptr) {
      fieldValue = String(raw);
    }
    json += jsonEscape(fieldValue.c_str());
    json += '"';
  }
  json += '}';
  return json;
}

String buildTranslationsJSON() {
  return buildTranslationsJSON(currentLanguage);
}





// Runtime language switching endpoint
void handleSetLanguage() {
  if (!server.hasArg("lang")) {
    sendJsonResponse(400, {
      jsonBoolField("success", false),
      jsonStringField("error", String(Texts::language_switch_error))
    });
    return;
  }

  String lang = server.arg("lang");
  lang.toLowerCase();
  Language target = LANG_EN;
  if (lang == "fr") {
    target = LANG_FR;
  } else if (lang == "en") {
    target = LANG_EN;
  } else {
    sendJsonResponse(400, {
      jsonBoolField("success", false),
      jsonStringField("error", String(Texts::language_switch_error))
    });
    return;
  }

  setLanguage(target);

  String response = F("{\"success\":true,\"language\":\"");
  response += (target == LANG_FR) ? "fr" : "en";
  response += F("\"}");
  server.send(200, "application/json; charset=utf-8", response);
}

// Language-aware translation extraction endpoint
void handleGetTranslations() {
  Language target = currentLanguage;
  if (server.hasArg("lang")) {
    String requested = server.arg("lang");
    requested.toLowerCase();
    if (requested == "fr") {
      target = LANG_FR;
    } else if (requested == "en") {
      target = LANG_EN;
    } else {
      sendJsonResponse(400, {
        jsonBoolField("success", false),
        jsonStringField("error", String(Texts::language_switch_error))
      });
      return;
    }
  }

  server.send(200, "application/json; charset=utf-8", buildTranslationsJSON(target));
}

// Log client connection with IP address
void logClientConnection(const char* endpoint) {
  if (server.client()) {
    IPAddress clientIP = server.client().remoteIP();
    Serial.printf("[Client] %s connected from IP: %s\r\n", endpoint, clientIP.toString().c_str());
  }
}

// ========== INTERFACE WEB PRINCIPALE MULTILINGUE ==========
// Unique JavaScript handler defined in sketch (handleJavaScriptRoute)
void handleJavaScriptRoute() {
  logClientConnection("JS Resource");
  unsigned long startTime = millis();

  // Use chunked transfer to avoid memory issues
  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "application/javascript; charset=utf-8", "");

  // ===== LOGS DE DÉBOGAGE =====
  Serial.println("\n========== JAVASCRIPT DEBUG (CHUNKED) ==========");
  Serial.printf("Free heap at start: %d bytes\n", ESP.getFreeHeap());

  // Send preamble
  String preamble = "console.log('";
  preamble += String(PROJECT_NAME) + " v";
  preamble += DIAGNOSTIC_VERSION_STR;
  preamble += " - Initialisation');const UPDATE_INTERVAL=5000;let currentLang='";
  preamble += (currentLanguage == LANG_FR) ? "fr" : "en";
  preamble += "';let updateTimer=null;let isConnected=true;";

  Serial.printf("Sending preamble: %d bytes\n", preamble.length());
  server.sendContent(preamble);

  // Send pin constants from board_config.h (BEFORE translations and static code)
  /*
  String pinVars = "const RGB_LED_PIN_R=";
  pinVars += String(current_rgb_r);
  pinVars += ";const RGB_LED_PIN_G=";
  pinVars += String(current_rgb_g);
  pinVars += ";const RGB_LED_PIN_B=";
  pinVars += String(current_rgb_b);
  pinVars += ";const DHT=";
  pinVars += String(DHT);
  pinVars += ";const LIGHT_SENSOR_PIN=";
  pinVars += String(current_light_sensor);
  pinVars += ";const DISTANCE_TRIG_PIN=";
  pinVars += String(current_distance_trig);
  pinVars += ";const DISTANCE_ECHO_PIN=";
  pinVars += String(current_distance_echo);
  pinVars += ";const MOTION_SENSOR_PIN=";
  pinVars += String(current_motion_sensor);
  pinVars += ";const PWM_PIN=";
  pinVars += String(BUZZER);
  pinVars += ";";
  */
  /* Serial.printf("Sending pin variables: %d bytes\n", pinVars.length()); */ // Totalement commenté pour éviter toute référence
  Serial.printf("  RGB_R=%d, RGB_G=%d, RGB_B=%d\n", current_rgb_r, current_rgb_g, current_rgb_b);
  Serial.printf("  DHT=%d, LIGHT=%d, MOTION=%d, PWM=%d\n", DHT, current_light_sensor, current_motion_sensor, BUZZER);
  Serial.printf("  DIST_TRIG=%d, DIST_ECHO=%d\n", current_distance_trig, current_distance_echo);


